---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.GetRuleName(Autodesk.Revit.DB.PerformanceAdviserRuleId)
source: html/c0cadd6a-a07a-e9e3-8b15-2c5440be2420.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.GetRuleName Method

Retrieves the name of the rule.

## Syntax (C#)
```csharp
public string GetRuleName(
	PerformanceAdviserRuleId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.PerformanceAdviserRuleId`) - The rule id to get information for.

## Returns
The name of the rule.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null